results/runs/ycsb/2026-06-21T15-36-11/mongodb/run_workload_e.txt
/opt/java/openjdk/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/mongodb-binding/lib/logback-classic-1.1.2.jar:/ycsb/mongodb-binding/lib/logback-core-1.1.2.jar:/ycsb/mongodb-binding/lib/mongo-java-driver-3.8.0.jar:/ycsb/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/ycsb/mongodb-binding/lib/mongodb-binding-0.17.0.jar:/ycsb/mongodb-binding/lib/slf4j-api-1.7.25.jar:/ycsb/mongodb-binding/lib/snappy-java-1.1.7.1.jar site.ycsb.Client -t -db site.ycsb.db.MongoDbClient -s -P workloads/workloade -p mongodb.url=mongodb://mongodb:27017/ycsb -p recordcount=100000 -p operationcount=100000 -p threadcount=10
Command line: -t -db site.ycsb.db.MongoDbClient -s -P workloads/workloade -p mongodb.url=mongodb://mongodb:27017/ycsb -p recordcount=100000 -p operationcount=100000 -p threadcount=10
YCSB Client 0.17.0

Loading workload...
Starting test.
2026-06-21 15:35:17:721 0 sec: 0 operations; est completion in 0 second 
mongo client connection created with mongodb://mongodb:27017/ycsb
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-06-21 15:35:27:676 10 sec: 27938 operations; 2792.96 current ops/sec; est completion in 26 seconds [INSERT: Count=1354, Max=147327, Min=291, Avg=2540.27, 90=5843, 99=18383, 99.9=46879, 99.99=147327] [SCAN: Count=26826, Max=193279, Min=272, Avg=3256.26, 90=8415, 99=21599, 99.9=41023, 99.99=186111] 
2026-06-21 15:35:35:755 18 sec: 72011 operations; 5455.25 current ops/sec; est completion in 8 second [INSERT: Count=2246, Max=40031, Min=266, Avg=1502.31, 90=3245, 99=14647, 99.9=33023, 99.99=40031] [SCAN: Count=41615, Max=48063, Min=267, Avg=2298.26, 90=5283, 99=15143, 99.9=30383, 99.99=41183] 
2026-06-21 15:35:41:914 24 sec: 100000 operations; 4543.67 current ops/sec; [CLEANUP: Count=10, Max=14423, Min=4, Avg=1455.6, 90=64, 99=14423, 99.9=14423, 99.99=14423] [INSERT: Count=1456, Max=29263, Min=266, Avg=1372.99, 90=2899, 99=12127, 99.9=26847, 99.99=29263] [SCAN: Count=26503, Max=43519, Min=273, Avg=2184.45, 90=4895, 99=13711, 99.9=24319, 99.99=34079] 
[OVERALL], RunTime(ms), 24241
[OVERALL], Throughput(ops/sec), 4125.242357988532
[TOTAL_GCS_G1_Young_Generation], Count, 112
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 675
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 2.784538591642259
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 112
[TOTAL_GC_TIME], Time(ms), 675
[TOTAL_GC_TIME_%], Time(%), 2.784538591642259
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 1455.6
[CLEANUP], MinLatency(us), 4
[CLEANUP], MaxLatency(us), 14423
[CLEANUP], 95thPercentileLatency(us), 14423
[CLEANUP], 99thPercentileLatency(us), 14423
[INSERT], Operations, 5056
[INSERT], AverageLatency(us), 1743.0371835443038
[INSERT], MinLatency(us), 266
[INSERT], MaxLatency(us), 147327
[INSERT], 95thPercentileLatency(us), 6787
[INSERT], 99thPercentileLatency(us), 15127
[INSERT], Return=OK, 5056
[SCAN], Operations, 94944
[SCAN], AverageLatency(us), 2537.1702477249746
[SCAN], MinLatency(us), 267
[SCAN], MaxLatency(us), 193279
[SCAN], 95thPercentileLatency(us), 9895
[SCAN], 99thPercentileLatency(us), 17023
[SCAN], Return=OK, 94944